Documents/ИА_ЗаявкаНаОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_ЗаявкаНаОбязательства</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИА_ИсторияСтатусовЗВС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ситуация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СостояниеЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСУ_СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Записан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИА_ИсторияСтатусовЗВС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ИсторияСтатусовЗВС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СостояниеЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗВС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаявкаНаОбязательства</v8:Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_СостояниеЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_СостояниеЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассмотретьНаФП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_НетВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_ЧастичныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_ВсёВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_НетВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_ЧастичныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_ВсёВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносНаСледующееФП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИА_ЗаявкаНаОбязательства/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВестиФППоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	ИспПодразделения = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	Элементы.Подразделение.Видимость = ИспПодразделения;

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Сотрудник   = ПараметрыСеанса.ТекущийПользователь;
		Объект.Дата        = ТекущаяДата();
		Если ВестиФППоОрганизациям Тогда
			Объект.Организация = ИА_НастройкиС.ЗначениеНастройкиТекПользователя(ПланыВидовХарактеристик.ИА_НастройкиПользователей.ОсновнаяОрганизация);
		КонецЕсли;
    КонецЕсли;
	
	Структура = ИА_ФП.ВернутьСтатусЗВС(Объект.Ссылка);
	Статус = Структура.Статус;
	//Статус = ПолучитьСтатус(Объект.Ссылка);
	
	
	ДобавитьЭлементОтбора(ЗВС.Отбор.Элементы, "Основание", ВидСравненияКомпоновкиДанных.Равно, ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Ложь), Истина);
	
	//ЗВС = ПолучитьЗВС(Объект.ссылка);
	//Если ЗначениеЗаполнено(ЗВС) Тогда
	//	Элементы.СформироватьЗВС.Доступность = ложь;
	//КонецЕсли;
	
	//ИА_Арчил Тваладзе 2016.05.31
	ПричинаОтказа = Структура.ПричинаОтказа;
	//Конец Арчил Тваладзе
	
	ВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьИДоступностьЭлементов()
	
	ПравоФП_УтверждениеЗаказовРуководителем  = ИА_ПраваС.ЗначениеПраваТекПользователя("ФП_УтверждениеЗаказовРуководителем");
	ПравоФП_ОтправкаНаРассмотрениеЗаказаНаФП = ИА_ПраваС.ЗначениеПраваТекПользователя("ФП_ОтправкаНаРассмотрениеЗаказаНаФП");
	ПравоФП_ОтменаОтклоненияЗаказа           = ИА_ПраваС.ЗначениеПраваТекПользователя("ФП_ОтменаОтклоненияЗаказа");
	
	Если ПравоФП_УтверждениеЗаказовРуководителем Или ПравоФП_ОтправкаНаРассмотрениеЗаказаНаФП Или ПравоФП_ОтменаОтклоненияЗаказа Тогда
		Элементы.Статус.ТолькоПросмотр = Ложь;
		//Элементы.Статус.КнопкаСпискаВыбора = Истина;
		//Элементы.Статус.КнопкаВыпадающегоСписка = Истина;
	Иначе
		Элементы.Статус.ТолькоПросмотр = Истина;
		//Элементы.Статус.КнопкаВыпадающегоСписка = Ложь;
	КонецЕсли;
	
	Элементы.Организация.Видимость = ВестиФППоОрганизациям;
	
	Если Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.Подготовлен") Тогда
		Элементы.ГруппаШапка1.ТолькоПросмотр   = Ложь;
		Элементы.ГруппаПодрСотр.ТолькоПросмотр = Ложь;
		Элементы.ПредметЗаказа.ТолькоПросмотр  = Ложь;
		
		Элементы.ГруппаШапка2.ТолькоПросмотр   = Ложь;
		Элементы.ПричинаОтказа.Видимость = Ложь;
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.УтвержденРуководителем") Тогда	
		
		Элементы.ГруппаШапка1.ТолькоПросмотр   = Истина;
		Элементы.ГруппаПодрСотр.ТолькоПросмотр = Истина;
		Элементы.ПредметЗаказа.ТолькоПросмотр  = Истина;
		
		Элементы.ГруппаШапка2.ТолькоПросмотр   = не ПравоФП_УтверждениеЗаказовРуководителем;
		Элементы.ПричинаОтказа.Видимость = Ложь;
	
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.РассмотретьНаФП") Тогда	
		
		Элементы.ГруппаШапка1.ТолькоПросмотр   = Истина;
		Элементы.ГруппаПодрСотр.ТолькоПросмотр = Истина;
		Элементы.ПредметЗаказа.ТолькоПросмотр  = Истина;
		
		Элементы.ГруппаШапка2.ТолькоПросмотр   = не ПравоФП_ОтправкаНаРассмотрениеЗаказаНаФП;
		Элементы.ПричинаОтказа.Видимость = Ложь;
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.Отклонен") Тогда 	
		
		Элементы.ГруппаШапка1.ТолькоПросмотр   = Истина;
		Элементы.ГруппаПодрСотр.ТолькоПросмотр = Истина;
		Элементы.ПредметЗаказа.ТолькоПросмотр  = Истина;
		
		Элементы.ГруппаШапка2.ТолькоПросмотр   = НЕ ПравоФП_ОтменаОтклоненияЗаказа;
		
		Элементы.ПричинаОтказа.Видимость = Истина;
		Элементы.ПричинаОтказа.ТолькоПросмотр = Ложь;
		
	иначе
		//
		М = Элементы.Статус.СписокВыбора.ВыгрузитьЗначения();
		Одобрен = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренПолностью_НетВыплат");
		Если М.Найти(Одобрен) = Неопределено Тогда 
			М.Добавить(Одобрен);
			Элементы.Статус.СписокВыбора.ЗагрузитьЗначения(М);
		КонецЕсли;
		//
		Элементы.ГруппаШапка1.ТолькоПросмотр   = Истина;
		Элементы.ГруппаПодрСотр.ТолькоПросмотр = Истина;
		Элементы.ПредметЗаказа.ТолькоПросмотр  = Истина;
		
		Элементы.ГруппаШапка2.ТолькоПросмотр   = Истина;
		Элементы.ПричинаОтказа.Видимость = Ложь;
		
	КонецЕсли;
	
	
	СуммаЗВС = СуммаЗВСПоОснованию(Объект.Ссылка);
	
	Элементы.ЗВС.КоманднаяПанель.Доступность = (Не (СуммаЗВС >= Объект.Сумма)) И (Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренПолностью_НетВыплат"));
	
КонецПроцедуры

Процедура ДобавитьЭлементОтбора(ЭлементыОтбораСписка, Фильтр, ВидСравнения, ЗначениеФильтра, ЗаполнятьПустым=ложь)  Экспорт 
	
	Если ЗначениеЗаполнено(ЗначениеФильтра) или ЗаполнятьПустым Тогда
		
		ЭлементОтбораСписка= ЭлементыОтбораСписка.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Фильтр);
		ЭлементОтбораСписка.ПравоеЗначение =ЗначениеФильтра;
		ЭлементОтбораСписка.ВидСравнения = ВидСравнения;
		ЭлементОтбораСписка.Использование = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Организация = ИА_ФП.ПолучитьГоловнуюОрганизацию(Объект.Организация);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗВС(Команда)
	
	Если Статус <> ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренПолностью_НетВыплат") Тогда
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПроцедураПослеПредупреждения", ЭтаФорма), "ЗВС можно вводить только для одобренной заявки на обязательства!");
		
		Возврат;
		
	КонецЕсли;
	
	СуммаЗВС = СуммаЗВСПоОснованию(Объект.Ссылка);
	СуммаНовогоЗВС = Объект.Сумма - СуммаЗВС;
	
	Если СуммаНовогоЗВС <=0 Тогда
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПроцедураПослеПредупреждения", ЭтаФорма), "Сумма введеных ЗВС больше или равно сумме документа!");
		
		Возврат;
		
	КонецЕсли; 
	
	ПарметрыФормы = Новый Структура("Основание, Сумма", Объект.Ссылка, СуммаНовогоЗВС);
	
	ФормаЗВС = ПолучитьФорму("Документ.ИА_ЗаказНаПриобретение.ФормаОбъекта", ПарметрыФормы, ЭтаФорма);
	
	//ЗаполнитьЗначенияСвойств(ФормаЗВС.Объект, Объект, , "Дата, Номер, Ссылка, Проведен");
	//ФормаЗВС.Объект.Основание = Объект.Ссылка;
	ФормаЗВС.Открыть();
	
	//ЗВСудалитьудалить = ф.объект.ссылка;
	
	//Если ЗначениеЗаполнено(ЗВСудалитьудалить) Тогда
	//	Элементы.СформироватьЗВС.Доступность = ложь;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцедураПослеПредупреждения(ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСписокВыбораФондов();	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораФондов()

	Отбор = Новый Структура();
	
	Отбор.Вставить("НаДату",        Объект.Дата);
	Отбор.Вставить("Организация",   Объект.Организация);
	Отбор.Вставить("Подразделение", Объект.Подразделение);
	 	
	Результат = иа_фп.ЗаполнитьСписокФондамиПоПодразделениям(Отбор);
	
	Если НЕ Результат = Неопределено Тогда
		
	   Элементы.Фонд.СписокВыбора.Очистить();

		Для каждого ТекЭлемент Из Результат Цикл
		  Элементы.Фонд.СписокВыбора.Добавить(ТекЭлемент);
		КонецЦикла; 
	
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСписокВыбораФондов()

&НаКлиенте
Процедура ФондПриИзменении(Элемент)
	Если Объект.Подразделение.Пустая() Тогда
		Отбор = Новый Структура("Организация, Фонд, Дата",
		                      Объект.Организация, Объект.Фонд, Объект.Дата);  
		                      
		 Объект.Подразделение = ИА_ФП.ПолучитьПодразделениеПоФонду(Отбор);
	КонецЕсли;
КонецПроцедуры

//Арчил	Тваладзе 21.04.2016 добавление файла.
&НаКлиенте
Процедура ФайлыТаблицаПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	Диалог.Заголовок = "Выберите файл"; 
	Диалог.ПолноеИмяФайла = "";
	Диалог.Каталог = ПолучитьКаталогХраненияФайловДокументаЗНО();
	Диалог.МножественныйВыбор = Ложь; 
	
	Если Диалог.Выбрать() Тогда 
		Элементы.ФайлыТаблица.ТекущиеДанные.ПутьКФайлу = Диалог.ВыбранныеФайлы;//Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКаталогХраненияФайлов()
	Возврат Константы.ИА_КаталогХраненияФайловФП.Получить();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКаталогХраненияФайловДокументаЗНО()
	
	КаталогХраненияФайлов = ПолучитьКаталогХраненияФайлов();
	
	Если Не (Лев(КаталогХраненияФайлов, 1) = "\") Тогда
	      КаталогХраненияФайлов = КаталогХраненияФайлов + "\";
	КонецЕсли;
	
	КаталогХраненияФайлов = КаталогХраненияФайлов + "ФайлыДокументаЗНО\";
	
	Возврат КаталогХраненияФайлов;
	
КонецФункции

&НаКлиенте
Процедура ФайлыТаблицаПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Попытка
		ЗапуститьПриложение(Элементы.ФайлыТаблица.ТекущиеДанные.ПутьКФайлу,,Ложь);
	Исключение
		Сообщить("Сбой открытия файла!", СтатусСообщения.Информация);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	ПутьКФайлу = ПолучитьКаталогХраненияФайловДокументаЗНО();
	Если ПутьКФайлу = "" Тогда
		Сообщить("В настройках не указан путь к хранению файлов!", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		УстановитьНомер();
	КонецЕсли;
	
	ВыбранноеИмя = "";
	АдресВременногоХранилища = "";
	Если ПоместитьФайл(АдресВременногоХранилища, ВыбранноеИмя, ВыбранноеИмя, Истина, УникальныйИдентификатор) Тогда
		
		ФайлНаДискеСуществует = Ложь;
		КаталогНаДиске = "";
		
		ПоместитьФайлОбъектаНачало(Объект.Номер, АдресВременногоХранилища, ВыбранноеИмя, ФайлНаДискеСуществует, КаталогНаДиске);  //ФайлНаДискеСуществует, КаталогНаДиске будут возвращены
		
		ВыбранныйВариантДействия = Неопределено;
		Если ФайлСуществует(КаталогНаДиске, ВыбранноеИмя) Тогда
			
			ВариантыДействий = Новый СписокЗначений;
			ВариантыДействий.Добавить(2, "Заменить");
			ВариантыДействий.Добавить(1, "Сохранить оба файла");
			ВариантыДействий.Добавить(0, "Отменить загрузку");
			
			дп = новый Структура("АдресВременногоХранилища,КаталогНаДиске,ВыбранноеИмя",АдресВременногоХранилища,КаталогНаДиске,ВыбранноеИмя);
			ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьФайлЗавершение", ЭтотОбъект,дп), "Файл "+ВыбранноеИмя+" уже существует!"+Символы.ПС+"Выберите действие которое надо совершить.", ВариантыДействий);     
			Возврат;
			
		КонецЕсли;
		
		ПоместитьФайлОбъектаОкончание(АдресВременногоХранилища, КаталогНаДиске, ВыбранноеИмя, ВыбранныйВариантДействия);

	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыбранныйВариантДействия = РезультатВопроса;
	ПоместитьФайлОбъектаОкончание(ДополнительныеПараметры.АдресВременногоХранилища, ДополнительныеПараметры.КаталогНаДиске, ДополнительныеПараметры.ВыбранноеИмя, ВыбранныйВариантДействия);
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	ОткрытиеФайла();		
КонецПроцедуры


&НаКлиенте
Процедура ФайлыТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	ОткрытиеФайла();	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеФайла()
	
	Если Элементы.ФайлыТаблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = Элементы.ФайлыТаблица.ТекущиеДанные.Имя;
	АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(имяФайла);
	Если ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		врИмяФайла = КаталогВременныхФайлов() + имяФайла;
		ДвоичныеДанные.Записать(врИмяФайла);
		ЗапуститьПриложение(врИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)
	
	Если Элементы.ФайлыТаблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Элементы.ФайлыТаблица.ТекущиеДанные.Имя;
	ДиалогОткрытияФайла.Заголовок = "Сохранение файла";
	Расширение = Сред(Элементы.ФайлыТаблица.ТекущиеДанные.Имя,Найти(Элементы.ФайлыТаблица.ТекущиеДанные.Имя, ".")+1);
    Фильтр = "(*."+ Расширение +")|*."+Расширение+"";
    ДиалогОткрытияФайла.Фильтр = Фильтр;
    ДиалогОткрытияФайла.Расширение = Расширение;
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(Элементы.ФайлыТаблица.ТекущиеДанные.Имя);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		ДвоичныеДанные.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПолноеИмяФайла(ВыбранноеИмя)
	
	КаталогХранения = ПолучитьКаталогХраненияФайловДокументаЗНО();
	КаталогХранения = КаталогХранения + СОКРЛП(Объект.Номер) + "\";
	
	КаталогХранения = КаталогХранения + ВыбранноеИмя;

	Возврат КаталогХранения;
	
КонецФункции

&НаСервере
Функция ПоместитьТекущийФайлВБуфер(ВыбранноеИмя)
	
	КаталогХранения	= ПолучитьПолноеИмяФайла(ВыбранноеИмя); 
	ФайлДляПередачи = Новый ДвоичныеДанные(КаталогХранения);
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ФайлДляПередачи, УникальныйИдентификатор);
	
	Возврат АдресВременногоХранилища;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПоместитьФайлОбъектаНачало(Номер, АдресВременногоХранилища, ВыбранноеИмя, ФайлНаДискеСуществует = Ложь, КаталогХранения = "")
	
	Если Найти(ВыбранноеИмя,"\")>0 или Найти(ВыбранноеИмя,"/")>0 Тогда
		Сч = СтрДлина(ВыбранноеИмя);
		Поз = 0;
		Пока Сч > 0 Цикл
			Симв = Сред(ВыбранноеИмя, Сч, 1);
			если Симв = "\" или Симв = "/" Тогда
				Поз = Сч;
				Прервать;
			КонецЕсли;
			Сч = Сч - 1;
		КонецЦикла;
		
		ВыбранноеИмя = Сред(ВыбранноеИмя, сч + 1);
	КонецЕсли;
	
	КаталогХранения = ПолучитьКаталогХраненияФайловДокументаЗНО();
	
	КаталогХранения = КаталогХранения + СОКРЛП(Номер) + "\"; КаталогФайлов = КаталогХранения;
	
	КаталогНаДиске = Новый Файл(КаталогХранения);
	
	Если НЕ КаталогНаДиске.Существует() Тогда
		СоздатьКаталог(КаталогХранения);
	КонецЕсли;
	
	ФайлНаДискеСуществует = ФайлСуществует(КаталогХранения, ВыбранноеИмя);
	
КонецПроцедуры
	
&НаСервере
Процедура ПоместитьФайлОбъектаОкончание(АдресВременногоХранилища, КаталогФайлов, ВыбранноеИмя, ВыбранныйВариантДействия = 0)
	
	Если ВыбранныйВариантДействия = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	МодифицироватьФайлПоВыбранномуДействию(КаталогФайлов, ВыбранноеИмя, ВыбранныйВариантДействия); 
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	КаталогХранения = КаталогФайлов + ВыбранноеИмя;
	ДвоичныеДанные.Записать(КаталогХранения);
	
	//СписокдобавленныхФайлов.Добавить(КаталогХранения);    //на случай, если задачу не сохранят и файлы придется удалять
	
	МассивСтрок = Объект.Файлы.НайтиСтроки(Новый Структура("Имя", ВыбранноеИмя));
	
	Если МассивСтрок.Количество()=0 Тогда
		НоваяСтрока = Объект.Файлы.Добавить();
	иначе 
		НоваяСтрока = МассивСтрок[0];
	КонецЕсли;
	
	НоваяСтрока.Имя = ВыбранноеИмя;
	НоваяСтрока.Дата = ТекущаяДата();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФайлСуществует(ИмяКаталога, ИмяФайла)
	
	КаталогНаДиске =  Новый Файл(ИмяКаталога+ИмяФайла);
	
	ФайлСуществует = КаталогНаДиске.Существует();
	
	КаталогНаДиске =Неопределено;
	
	Возврат ФайлСуществует;
	
КонецФункции

&НаСервере
Процедура МодифицироватьФайлПоВыбранномуДействию(ИмяКаталога, ИмяФайла, ВыбранныйВариантДействия = 0) 
	
	КаталогНаДиске =  Новый Файл(ИмяКаталога+ИмяФайла);
 
	ИмяФайлаБезРасширения = КаталогНаДиске.ИмяБезРасширения; 
	Расширение = КаталогНаДиске.Расширение;
	НовоеИмяФайла = ИмяФайла;
	Сч =0;
	
	Если ВыбранныйВариантДействия = 2 Тогда //Замещаем файл на диске
		
	ИначеЕсли ВыбранныйВариантДействия = 1 Тогда // Добавляем к имени файла _<сч>
		
		Пока КаталогНаДиске.Существует() Цикл
			
			Сч = Сч + 1; 
			НовоеИмяФайла = ИмяФайлаБезРасширения + "_" + Сч + Расширение;
			КаталогНаДиске = Новый Файл(ИмяКаталога + НовоеИмяФайла);
			
			//навсякий случай прерывание.
			Если Сч = 1000000000 тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Слишком много файлов в каталоге! Выберите другой каталог!"; 
				Сообщение.Сообщить();
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;	
		
	Иначе    //отмена добавления файла
		Возврат;
	КонецЕсли;
	
	ИмяФайла = НовоеИмяФайла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНомер()
	
	Если НЕ ЗначениеЗаполнено(Объект.Номер) Тогда
		
		об = РеквизитФормыВЗначение("Объект");
        об.УстановитьНовыйНомер();
        ЗначениеВРеквизитФормы(об, "Объект");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ДатаОплаты<>ТекущийОбъект.Ссылка.ДатаОплаты и ТекущийОбъект.ДатаОплаты<НачалоДня(ТекущаяДата()) Тогда
		Отказ = Истина;
		Сообщить("Укажите корректный срок оплаты!");
		возврат;
	КонецЕсли;

	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Статус", Статус);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПричинаОтказа", ПричинаОтказа);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Статус <> ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.ОдобренПолностью_НетВыплат") Тогда
			Элементы.ГруппаШапка.ТолькоПросмотр = Истина;
			Элементы.ГруппаПодрСотр.ТолькоПросмотр = Истина;
			Элементы.ПредметЗаказа.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструкцию(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	ОткрытьФорму("ОбщаяФорма.ИА_ФП_БазаЗнанийПЗП", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Элементы.ПричинаОтказа.Видимость = (Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.Отклонен"));
	Элементы.ПричинаОтказа.Доступность = (Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.Отклонен"));
	Элементы.ПричинаОтказа.ТолькоПросмотр = (Статус <> ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.Отклонен"));
КонецПроцедуры

&НаСервереБезКонтекста
Функция СуммаЗВСПоОснованию(ДокументОснование)
	
	СуммаЗВС = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ИА_ЗаказНаПриобретение.Сумма), 0) КАК Сумма
	               |ИЗ
	               |	Документ.ИА_ЗаказНаПриобретение КАК ИА_ЗаказНаПриобретение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ИсторияСтатусовЗВС.СрезПоследних(, ) КАК ИА_ИсторияСтатусовЗВССрезПоследних
	               |		ПО ИА_ЗаказНаПриобретение.Ссылка = ИА_ИсторияСтатусовЗВССрезПоследних.ЗВС
	               |ГДЕ
	               |	ИА_ЗаказНаПриобретение.Основание = &Основание
	               |	И ИА_ЗаказНаПриобретение.Проведен
	               |	И ИА_ИсторияСтатусовЗВССрезПоследних.Статус <> &Статус";
	
	Запрос.УстановитьПараметр("Основание", ДокументОснование);
	Запрос.УстановитьПараметр("Статус", Перечисления.ИА_СостояниеЗаказа.Отклонен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СуммаЗВС = ВыборкаДетальныеЗаписи.Сумма;
	КонецЕсли;
	
	Возврат СуммаЗВС;
	
КонецФункции

&НаКлиенте
Процедура ЗВСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура ЗВСПриИзменении(Элемент)
	ВидимостьИДоступностьЭлементов();
КонецПроцедуры
//Конец Арчил Тваладзе 21.04.2016
